[
    [
        {
            "employmentdate": "2019-09-02 00:0 TO 2020-06-15 00:0",
            "filingdate": "1/20/19 orUntil Filled",
            "hours": "16",
            "pay": "12.39",
            "schedule": "tbd",
            "skillspref": "-Previous experience with Residential Life",
            "skillsreq": "MINIMUM QUALIFICATIONS:- Must be and remain a fully registered and fully enrolled UCSC student as defined by the registrar’s office – RAs may not be part-time students;- Must have and maintain a 2.5 GPA or higher at the time of application and throughout the period of employment;- Must be in good judicial standing – although having a judicial record may not necessarily disqualify a candidate, significant policy violations, or being on judicial probation will likely render a candidate ineligible for hire to this position.- Must be available for training in fall quarter- Must commit to the entire year's contract (through June 2020)",
            "title": "The Village Resident Assistant",
            "unit": "The Village"
        },
        {
            "employmentdate": "2-20-2019 TO 6-10-2020",
            "filingdate": "2/1/19 orUntil Filled",
            "hours": "8-10",
            "pay": "12.00",
            "schedule": "",
            "skillspref": "Experience working in a lab (can be through teaching courses or research)Thorough knowledge of sustainability issues including: energy & water efficiency, green purchasing, and waste diversion (applying sustainable operations to labs a plus!)Lab Safety Training",
            "skillsreq": "Excellent motivation and organizational skills with ability to prioritize work and complete tasks independently in a fast-paced environmentConfidence in interacting and articulately communicating with UC research faculty, Lab P.I.'s and Safety Representatives, and campus operational staffExcellent command of Google Apps (gmail, G-Cal, Drive, etc.)Ability to work 10 hours/week in Sustainability Office (Kerr Hall)Strong interest in working with UCSC laboratories to promote sustainable researchAbility to communicate in a highly professional manner in-person, email, phone, etc.Excellent collaboration skills and experience working in teamsStrong interest in sustainability issues including: energy efficiency, green purchasing, and waste diversionExcellent attention to detailMust be available during the following academic year (Fall 2019-2020)",
            "title": "Green Labs Associate",
            "unit": "Sustainability Office"
        },
        {
            "employmentdate": "ASAP TO 6-14-2019",
            "filingdate": "Until Filled",
            "hours": "10-20",
            "pay": "11.50",
            "schedule": "By Arrangement",
            "skillspref": "We seek but do not require a commitment to working with us throughout the Summer (one week off) in  leadership positions with better appropriate compensation. Discounted housing is available for the Summer.",
            "skillsreq": "Prior experience in building maintenance, grounds maintenance, painting, construction work or as a work crew member required. Familiarity with university or residential facilities maintenance.Demonstrated mechanical aptitude and skill.Demonstrated knowledge of safety practices in the use of hand- and power tools.Ability to follow written and oral instructions and exercise good judgment. Ability to work under moderate to minimal supervision in a cooperative, team-focused workplace. Ability to help direct and support the work of new student employees, and to encourage safe work practices among peers.The ability to work cooperatively and respectfully with a diverse student and staff population.Demonstrated ability to quickly learn and apply new mechanical skills.Excellent communication skills; a willingness to positively represent the Central Zone Facilities. Demonstrated ability to be self motivated.Ability to safely lift and carry 50 lbs. unassisted. The ability to work from stepladders, to perform work overhead, and to perform tasks that require repetitive motions. Ability to drive in the state of CA. With good driving record.The selected candidate will be fingerprinted, and a background check will be conducted.",
            "title": "Maintenance Specialist - Central Zone",
            "unit": "Facilities"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "5-10",
            "pay": "13.00",
            "schedule": "",
            "skillspref": "Affiliated with Rachel Carson College1. Have taken CRSN 15, are declared in a STEM major and maintaining academic standing in STEM courses.2. Record of high academic achievements in area or areas in which mentoring is offered. 2. Ability to relate materials in a sensitive and effective manner and general understanding of mentoring dynamics. 3. Experience working with students from multi-cultural and multi-ethnic backgrounds, students with disabilities, and/or economically disadvantaged students.",
            "skillsreq": "Rachel Carson College invites applications for a new program through which continuing STEM students will provide peer assistance and mentorship to first and second year proposed and declared STEM majors who are enrolled in or have taken  CRSN 15 \"Strategies to Jump Start your STEM Learning.\"  STEM Peer Mentors will work with preceptors and advisors in the college to learn the basic skills of student-student peer mentoring. Mentors will assume college leadership roles in developing advising strategies, identifying STEM student needs in particular courses, and training future Mentors. Mentors will also work closely with CRSN 15 instructors to help students make the transition to University-level work, advising them on strategies for effective time management, studying, note-taking and test taking, participate in classes and group sessions (as required) and hold office hours to provide students with experiential knowledge specific to STEM fields. Strong leadership, communication, and interpersonal skills• Must be comfortable speaking in front of large groups of people• Junior or senior standing preferred• Declared in a STEM major• 3.0 or higher UCSC grade point average• Knowledge of and/or experience with academic resources for STEM students",
            "title": "STEM Peer mentor",
            "unit": "CRSN/Oakes College"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "1/31/19 orUntil Filled",
            "hours": "5-12",
            "pay": "12.00",
            "schedule": "",
            "skillspref": "Demonstrated event planning or project planning experiencePrior involvement with Muslim student groups, and/or Muslim community on or off campusDesktop publishing, flyer/poster design, website design and maintenanceFamiliarity or direct experience with related campus groups and committees",
            "skillsreq": "Experience with, and knowledge of, Southwest Asian North African community and culture, with focus on Muslim student needs and experiencesStrong oral, written, and interpersonal skills sufficient to interact with a diverse staff and studentsStrong organizational skills and leadership experienceBasic typing and computer skills, familiarity with Google Drive Apps, Microsoft Office (Word, Excel, Powerpoint)Ability to work under pressure with multiple ongoing projects, varying deadlines, and numerous interruptionsAbility to work collectively in a teamwork environmentMust be responsible, reliable, resourceful, and have initiativeExperience with, and knowledge of, student organizations, campus support services and co-curricular activities",
            "title": "SWANA Programs Intern",
            "unit": "ERC"
        },
        {
            "employmentdate": "ASAP TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "10-15",
            "pay": "17.00",
            "schedule": "Varies",
            "skillspref": "Knowledge and experience working with SQL, Ceph, or protocol buffers is a plus.Courses preferred: Database systems (CMPS 180, 181, or 278)",
            "skillsreq": "To help meet the programing needs of the SkyhookDB incubator, the Center for Research in Open Source Software (CROSS) is looking for a part-time programming assistant to assist our current incubator lead. The programming assistant will work directly with the project scientist leading this incubator as well as with PhD students working on the development of other CROSS-funded research. Development is centered around two open source products: PostgreSQL database and Ceph distributed storage.  Candidates should be Computer Science or Computer Engineering undergraduate or masters student with coding experience, knowledge of C++ and Linux.Courses required: Operating systems (CMPS 111)",
            "title": "Programming Assistant",
            "unit": "SOE"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "20",
            "pay": "11.00",
            "schedule": "Mon-Fri 7am-4pm",
            "skillspref": "Basic computer troubleshooting skills; Math/accounting aptitude; proven ability to make independent judgment calls; demonstrated ability to work ,with people of varied races, ages and socioeconomic backgrounds.",
            "skillsreq": "Clerical/receptionist experience. Experience with filing, writing and answering  phones; detail oriented; strong ability to prioritize; good organizational skills; Intermediate skills in Microsoft Word, Publisher and Excel; ability to lift 50 pounds with or without assistance.",
            "title": "Custodial Office Assistant",
            "unit": "Facilities"
        },
        {
            "employmentdate": "ASAP TO 4-1-2019",
            "filingdate": "Until Filled",
            "hours": "10",
            "pay": "13.00",
            "schedule": "flexible",
            "skillspref": "Experience in iOS programming and submitting apps to the app store and the use of TestFlight.",
            "skillsreq": "iOS programming and submitting apps to the app store and the use of TestFlight.",
            "title": "iOS Programmer",
            "unit": "Social Sciences - Psychology"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "1/11/19 orUntil Filled",
            "hours": "0",
            "pay": "1.00",
            "schedule": "must be zero for BYA's",
            "skillspref": "Experience with Voter Registration CampaignsExperience and Knowledge on current educational climate and policyOrganizing Background with various identities, communities and backgroundsKnowledge about the UC Student Association and its current campaignsA licensed driver",
            "skillsreq": "Attend UCSA Board Meetings with the Vice President of External Affairs and the Legislative DirectorBe able to work with a diverse group of students.Be able to work well independently and with a group.Pay close attention to detail.Be extremely organized and able to balance their work.Have experience working on student or educational campaigns.Excellent communication skillsAbility to interact with Administration, Students, Faculty on a professional Level.Ability to learn tasks quickly and implement them effectively.Ability to work in a fast paced environment.Ability to lead othersAbility to work under UCSA StaffAbility to schedule meetings with community membersCommit to monthly UCSA Board Meetings and lobby visitsAttend weekly staff meetings under EVP office",
            "title": "SUA Campus Organizing Director",
            "unit": "Student Affairs"
        },
        {
            "employmentdate": "ASAP TO 6-14-2019",
            "filingdate": "Until Filled",
            "hours": "12-19",
            "pay": "11.50",
            "schedule": "By Arrangement",
            "skillspref": "",
            "skillsreq": "Prior experience in building maintenance, grounds maintenance, painting, construction work or as a work crew member required. Familiarity with university or residential facilities maintenance.Demonstrated ability to have a high mechanical aptitude.Demonstrated knowledge of safety practices in the use of hand- and power tools.Ability to follow written and oral instructions and exercise good judgment.  Ability to work under moderate to minimal supervision in a cooperative, team-focused workplace with a diverse student and staff population. Ability to help direct and support the work of new student employees, and to encourage safe work practices among peers. The ability to work cooperatively and respectfully with a diverse student and staff population.The ability to lift and carry items of up to 50 lbs., with or without accommodation; to work from stepladders; to perform work overhead; and to perform tasks requiring repetitive motion.Demonstrated ability to quickly learn and apply new mechanical skills.Excellent communication skills. Willingness to positively represent the Zone facilities staff. Exhibit a high level of responsibility and attention to detail.Ability to drive in the state of California and possession of a  good driving record.Demonstrated ability to be self motivated.",
            "title": "Maintenance Specialist - East Zone",
            "unit": "Facilities"
        },
        {
            "employmentdate": "TO 2019-06-30 00:0",
            "filingdate": "Until Filled",
            "hours": "5-10",
            "pay": "13.00",
            "schedule": "",
            "skillspref": "At least three quarters prior experience a Cantú Queer Resource Center internMaintain a cumulative GPA of 3.0 or higher.Prior experience with Queer studies, Trans studies, or diversity related courses.",
            "skillsreq": "Must have prior experience as a Lionel Cantú Queer Resource Center intern for at least 2 quarters Must maintain a 2.5 average GPAOutstanding leadership and organizational skills. Strong knowledge of and experience with Cantú Queer Center operations, policies, and procedures.Strong knowledge of and experience with all Resource Centers (Asian American/Pacific Islander RC, African American Resource and Cultural Center, American Indian RC, El Centro: Chicanx Latinx RC and the Women's RC.)Knowledge of issues affecting Queer and Trans students in higher education, and the broader community.Ability to mentor and assist in supervising Interns and volunteers.Must have strong oral, written, and interpersonal skills sufficient to interact with a diverse staff and students. Basic typing and computer skills. Ability to work under pressure with multiple ongoing projects, varying deadlines, and numerous interruptions. Must have the ability to work collectively in a teamwork environment. Must be responsible, reliable, resourceful, and have initiative. Experience with, and knowledge of, LGBTQIA+ student organizations at UCSC; experience with, and knowledge of, campus support services and co-curricular activities, especially for Queer & Trans students.",
            "title": "Cantú Lead Intern",
            "unit": "GLBT"
        },
        {
            "employmentdate": "2019-01-06 00:0 TO 2019-03-22 00:0",
            "filingdate": "Until Filled",
            "hours": "10",
            "pay": "16.26",
            "schedule": "M-F",
            "skillspref": "",
            "skillsreq": "Skills, Knowledge, and Abilities: 1. Proven record of high academic achievements in area or areas in which tutorial assistance is offered. 2. Ability to relate materials in a sensitive and effective manner and general understanding of tutoring dynamics. 3. Experience working with students from multi-cultural and multi-ethnic backgrounds, students with disabilities, and/or economically disadvantaged students. 4. Good academic standing, ability to listen, have commitment, and at least JUNIOR status or proven mastery of subject area.",
            "title": "MSI Learning Assistant/Tutor",
            "unit": "Learning Support Services"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "Until Filled",
            "hours": "4",
            "pay": "12.00",
            "schedule": "variable",
            "skillspref": "Demonstrated knowledge of Windows and Macintosh computer systems.  Knowledge of web streaming technologies.  Experience with audio or video editing software.  Experience with AV equipment and video recording.  Experience with computer graphics sufficient to produce operating instructions and diagrams.",
            "skillsreq": "Strong customer service skills required. Knowledge of audio-visual equipment (digital audio recorders, digital video and still cameras, video/data projectors; sound systems) sufficient to operate unsupervised.  Good mechanical aptitude sufficient to operate and troubleshoot a wide variety of audio-visual and computing equipment. Ability to learn basic operation and installation methods of audio-visual and computing equipment in facility.  Communication skills sufficient to explain technical concepts to non-technical people and interact effectively and courteously with faculty, staff, students and off-campus clients. Ability to use web content management systems, social media, and film editing software. Clerical skills including typing, data entry, filing, telephone, and organizational skills.  Ability to follow verbal and written instructions.  Ability to troubleshoot basic technical problems and develop appropriate solutions.  Ability to transport equipment safely, by exercising appropriate judgment.",
            "title": "Emeriti Association AV Assistant",
            "unit": "University Relations"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "1/16/19 orUntil Filled",
            "hours": "15-20",
            "pay": "12.00",
            "schedule": "M-W-F TBD",
            "skillspref": "Experience with courses related to agroecology.",
            "skillsreq": "Must have completed Chadwick Garden internshipCompetence in raised bed gardening, including cultivation, transplanting & seeding, cover crops and harvest.As this job involves physical labor, candidates must be able to lift 40 lbs. and perform physical work.Support Manager and Assistant Manager in facilitating student engagement in all garden related activities.May be asked to cover weekend watering on an as needed basis.",
            "title": "Garden Assistant",
            "unit": "Social Sciences - Agroecology"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "12/31/18 orUntil Filled",
            "hours": "20",
            "pay": "11.00",
            "schedule": "Monday -  Friday",
            "skillspref": "*Good interpersonal skills sufficient to interact effectively with co-workers, campus community, staff, and other students. *Prioritize assignments, customer service needs and interruptions while working independently.*Perform manual labor and safely lift supplies while bending and/or stooping.",
            "skillsreq": "*Ability to exercise diplomacy in dealing with diverse groups of people.*Read, write, and follow oral and written instructions and demonstrate mechanical aptitude.*Possess valid CA Driver's License*Safely drive a University vehicle*Work independently with moderate supervision.*Identify hazardous problems and use good judgment as to when to report problems/safety hazards.*Ability to navigate and work with Windows-based & Mac software.*Must be able to be in the outdoors in various weather conditions.*Must be able to lift 50 lbs.",
            "title": "Student Auto Attendant",
            "unit": "Fleet Services"
        },
        {
            "employmentdate": "1-7-2019 TO 9-30-2019",
            "filingdate": "1/1/19 orUntil Filled",
            "hours": "10-15",
            "pay": "11.50",
            "schedule": "flexible",
            "skillspref": "(1) familiarity with campus resources, events, opportunities, fees, policies, and so on.(2) Social media activity.(3) Presentation skills - to be a good public speaker and enjoy it.  (coaching available)(4) fluent in Spanish, Mandarin, Cantonese, or other language needed to support students and their families(5) preferred but not required - you have taken or plan to take Summer Session classes.",
            "skillsreq": "(1) Excellent interpersonal skills - polite, tactful, warm, patient.  Communication (written and verbal) is thorough and accurate. Enjoy customer service.(2) Strong computer skills - research, excel, calendaring, editing/review of written work, documents, newsletters. (Some training available but should be familiar with these programs.)(3) Highly organized, terrific time management, with the ability to organize our office and build new processes to increase efficiency and save resources.(4) Independent worker with team-work orientation - very small office (4 staff, 4 students, small space) so collaborative work style and adaptability a must.*note additional 2 requirements:Please submit a cover letter introducing yourself and what strengths you would bring to the Summer Session Office, how you would contribute to our team. Describe a time when you positively contributed to a team that shows you learn new skills quickly. Write about yourself with your personality!  Submissions without a cover letter will not be reviewed.Student Assistants are needed ALL summer (20-40 hours per week, flexible for classes, etc.).  Only applicants who can work in summer will be considered for the winter/spring/fall job.",
            "title": "Summer Session Student Assistant",
            "unit": "VPDUE-Summer Session"
        },
        {
            "employmentdate": "2018-09-23 00:0 TO 2019-06-15 00:0",
            "filingdate": "Until Filled",
            "hours": "6-8",
            "pay": "11.50",
            "schedule": "Monday-Friday",
            "skillspref": "Experience with Macintosh word processing programs. Experienced and knowledgeable in waste reduction and management. Experience with desktop publishing and web design. Ability to recognize a gap in the waste reduction program, and determine a low impact solution.",
            "skillsreq": "Has taken college level courses relating to environmental and social issues.  Must be self motivated , have a positive work attitude, and be able to work in a composting team atmosphere. Ability to work with word processing programs. Ability to conduct research in preparation for developing an organized presentation. Translate/demonstrate daily program goals to diverse populations using strong public speaking skills. Ability to be a role model. Ability to work safely with general cleaning chemicals. Must be able to work a steady number of hours per week throughout each quarter. Ability to bend and lift and perform other repetitive motions.Possession of a valid California driver’s license and a good driving record.",
            "title": "Waste Reduction Program Specialist - West Zone",
            "unit": "Facilities"
        },
        {
            "employmentdate": "2018-09-23 00:0 TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "10+",
            "pay": "12.50",
            "schedule": "Mon - Fri 7:00 am-3:30pm",
            "skillspref": "Must have a valid Driver's License",
            "skillsreq": "Ability to comprehend Grounds policies and procedures. Ability to work independently with minimal supervision. Ability to make decisions and prioritize the management of projects. Ability to work effectively in dealing with diverse groups of people. Clear oral and written communication skills. Basic knowledge of Windows, Word, Excel and File Maker Pro.Ability to  fill out weekly Excel timesheets & bi-monthly Cruz Pay electronic timesheets punctually and accurately. . Ability to safely use small powered equipment and wear required safety gear. Ability to safely move containers and equipment weighing up to 50 pounds with or without accommodation. Ability to work outdoors in all weather conditions and in dusty/pollen conditions. Possession of a valid drivers license. Available to work in at least 3 hour blocks anytime between 7:00am and 3:30 pm M-F",
            "title": "Grounds Student Assistant",
            "unit": "Physical Plant"
        },
        {
            "employmentdate": "ASAP TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "10 - 20",
            "pay": "11.00",
            "schedule": "TBD",
            "skillspref": "Prefer experience with Mac OS page layout skills, including a familiarity with Adobe InDesign, Illustrator and Photoshop. At least basic carpentry skills are desired. Prefer familiarity or at least a basic comfort level in safely handling power tools such as portable drills, multi-tools, handheld powered saws and table saws, as well as hammers, screwdrivers, wrenches and other hand tools.  Skills to edit video and add subtitles to video on Mac OS computers for use on digital frames and digital players attached to large screen televisions desired. The ability to edit and add subtitles to video, experience in gaming development to create Mac OS or iOS interactives, including AR or VR creation for interactive exhibit components are also desirable skills.The ability or willingness to learn to analyze a malfunctioning piece of AV or other exhibit related equipment to determine the cause and a simple solution is desired.Basic knowledge of construction and art sheet materials, adhesives and hardware preferred. Prefer proven artistic and mechanical skills, with a keen aesthetic sense and other relevant capabilities for potential involvement in the design and fabrication of exhibits as opportunities arise. A current, valid driver's license is preferred.",
            "skillsreq": "Basic mechanical aptitude and aesthetic sense. Some experience in using basic hand and power tools to do light construction or at least make repairs to exhibit elements. Must be detailed oriented, but most importantly must be comfortable multi-tasking, and when necessary, making decisions requiring creative \"outside-of-the-box\" problem-solving skills. Ability to realize when to ask for guidance. Some moderate lifting with and without assistance.The ability to work independently as well as able to work as a team with volunteers and staff. Be reliable to arrive when scheduled and to work safely with tools and equipment around the public, volunteers and other staff. Able to select proper cleaning products and techniques to clean exhibit component surfaces without damaging them. A large part of the job is cleaning and providing assistance to Exhibits Curator/Designer through miscellaneous tasks as assigned. Willingness to get dirty, and to occasionally work non-standard evening or weekend hours during installations or major projects is helpful.Ability to safely use step and platform ladders to clean and maintain elevated exhibit components is expected.Must be neat and clean in appearance and willing to wear a Seymour Marine Discovery Center uniform of logo navy polo shirt with khaki pants.",
            "title": "Exhibits Assistant",
            "unit": "PB Sci-IMS/LML"
        },
        {
            "employmentdate": "TO 2019-06-30 00:0",
            "filingdate": "6/30/19 orUntil Filled",
            "hours": "0",
            "pay": "1.00",
            "schedule": "Must be 0 for BYA's",
            "skillspref": "Experience in staffing events",
            "skillsreq": "Must be able to have a reliable mode of transportation to arrive on timeMust be able to speak some English Must be a current undergraduate student at the University of California, Santa CruzMust have the ability to lift up to 30 lbs with or without accommodation.Eagerness to be involved in the Student Union Assembly Ability to work in a fast environment Positive AttitudeAbility to adapt to change",
            "title": "SUA Special Events Assistant",
            "unit": "Student Affairs"
        },
        {
            "employmentdate": "8-1-2018 TO 6-30-2019",
            "filingdate": "Until Filled",
            "hours": "no more than 20",
            "pay": "14.00",
            "schedule": "varied",
            "skillspref": "• Maintain a good academic standing.• Ability to communicate orally and in writing in English and Spanish.• Possession of valid California Driver’s License.• Familiarity working with parents/ families.• Experience presenting and facilitating workshops.• Knowledge about A-G college requirements, financial aid programs, and the college application process.",
            "skillsreq": "MUST BE FLUENT IN ENGLISH AND SPANISH.  POSITION IS OFF CAMPUS IN WATSONVILLE• Desire to work with educational disadvantaged and low-income middle school parents and students.• Sensitivity to diverse racial, ethnic, and/or low socioeconomic groups.• Dependable and professional work attitude.• Strong leadership, communication, and interpersonal skills.• Strong organizational and time management skills.• Demonstrate excellent judgment and discretion in handling confidential and sensitive information.• Demonstrate strong attention to detail.• Ability to work independently with minimal supervision and establish and maintain effective work relationships.• Ability to accurately follow oral and written instructions.• Ability to ask clarifying questions.• Ability to work between 12-19 hours a week with some special exceptions.• Ability to work a flexible schedule, including evening and weekend events.• Ability to travel to and from schools, homes, and program office. • Basic knowledge and understanding of computer technology (Macintosh or Window system).• Desire to learn additional software, as required by the department.• Undergraduate status applicants only.**MUST BE BILINGUAL IN ENGLISH AND SPANISH*****MUST HAVE CAR TO TRAVEL TO SCHOOL SITE IN WATSONVILLE**",
            "title": "EPC Family Involvement Intern",
            "unit": "EPC"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "Until Filled",
            "hours": "15-19",
            "pay": "14.00",
            "schedule": "Variable w/in M-F 8a-5p",
            "skillspref": "• Have one semester of college experience.• Stem Major or background.• Knowledge or academic and college preparation programs such as GEAR UP, EAOP, MESA, AVID or Upward Bound.• Prior Tutoring experience in math, English language arts, science and history at secondary schools.",
            "skillsreq": "•Must be an undergraduate student at an institution of higher education.•Documentation of exemplary completion of math courses through Algebra II and above. •The ability to communicate effectively and respectfully with people from different racial, ethnic, and cultural backgrounds and lifestyles, demonstrating sensitivity to their needs.•Experience and discretion in handling confidential and sensitive information.•Work independently with minimal supervision and establish and maintain effective work relationships within the EPC and school site; work independently or within a team.•Ability to work a minimum of 15 hours per week, M-F and some evenings and weekends.•Prepare and present written and oral information clearly and effectively.•Working knowledge of computer operating systems (Microsoft Word, Excel, File Maker Pro), peripherals, software, e-mail and internet access. •Ability to sit at a desk and use a computer for long periods of time.•Maintain good academic standing at enrolled institution of higher education; must enroll in 12 units per quarter/semester.•* If applying to the San Jose Cal-SOAP Academic Coach position, candidate must be able to demonstrate financial need (quality for student loans, workstudy, etc.).•Must have a minimum overall GPA of 2.5•Must have California driver’s license.•Must poses reliable mode of transportation to school-site and/or program office.",
            "title": "EPC Academic Coach/Intern",
            "unit": "EPC"
        },
        {
            "employmentdate": "TO 2019-06-30 00:0",
            "filingdate": "Until Filled",
            "hours": "4-6",
            "pay": "23.00",
            "schedule": "variable",
            "skillspref": "",
            "skillsreq": "1.      Demonstrate a commitment and ability to retain, motivate, and engage historically marginalized students with intention and cultural humility. 2.      Previous experience mentoring or supervising undergraduate students through research projects (e.g., supervising Research Assistants).3.      Experience teaching and/or mentoring community college student, students with disabilities, first-generation students, and/or economically disadvantaged students.4.      Record of high academic achievements and strong program of research in Humanities, Social Sciences, STEM, or Arts. Good academic standing.5.      General understanding of mentoring in research, mentorship dynamics and ability to relate materials in a mindful and effective manner.6.      Demonstrate commitment and patience to learn new methods of engaging with historically marginalized students.",
            "title": "Graduate Research Mentor",
            "unit": "SAEI"
        },
        {
            "employmentdate": "ASAP TO 6-23-2019",
            "filingdate": "Until Filled",
            "hours": "5",
            "pay": "11.00",
            "schedule": "Varies",
            "skillspref": "Ability to work outside and lift and move garden materials.",
            "skillsreq": "Education or experience in one or more of the following areas: gardening, horticulture, plant science, or strong desire to learn how to grow, build and maintain a garden. Strong communication skills; organizational skills and leadership experience; experience working in a team environment; cultural competency skills",
            "title": "Colleges 9 & 10 Garden Club Lead",
            "unit": "College Nine & College Ten"
        }
    ],
    [
        {
            "employmentdate": "1-21-2019 TO 6-29-2019",
            "filingdate": "1/7/19 orUntil Filled",
            "hours": "10 - 20",
            "pay": "13.00",
            "schedule": "TBD",
            "skillspref": "Experience with enrollment in online courses, software/QA testing, problem reporting and/or proofreading is welcome, but not required.",
            "skillsreq": "The position requires an individual with excellent attention to detail and a critical yet problem-solving mindset. Strong writing skills, reasonable computer skills, and experience with Canvas are a necessity. This position requires the individual to have and use their own portable computer.",
            "title": "Online Education Quality Testing Assistant",
            "unit": "Academic Affairs"
        },
        {
            "employmentdate": "ASAP TO 6-14-2019",
            "filingdate": "Until Filled",
            "hours": "10-20",
            "pay": "11.50",
            "schedule": "By Arrangement",
            "skillspref": "We seek but do not require a commitment to working with us throughout the Summer (one week off) in  leadership positions with better appropriate compensation. Discounted housing is available for the Summer.",
            "skillsreq": "Prior experience in building maintenance, grounds maintenance, painting, construction work or as a work crew member required. Familiarity with university or residential facilities maintenance.Demonstrated mechanical aptitude and skill.Demonstrated knowledge of safety practices in the use of hand- and power tools.Ability to follow written and oral instructions and exercise good judgment. Ability to work under moderate to minimal supervision in a cooperative, team-focused workplace. Ability to help direct and support the work of new student employees, and to encourage safe work practices among peers.The ability to work cooperatively and respectfully with a diverse student and staff population.Demonstrated ability to quickly learn and apply new mechanical skills.Excellent communication skills; a willingness to positively represent the Central Zone Facilities. Demonstrated ability to be self motivated.Ability to safely lift and carry 50 lbs. unassisted. The ability to work from stepladders, to perform work overhead, and to perform tasks that require repetitive motions. Ability to drive in the state of CA. With good driving record.The selected candidate will be fingerprinted, and a background check will be conducted.",
            "title": "Maintenance Specialist - Central Zone",
            "unit": "Facilities"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "5-10",
            "pay": "13.00",
            "schedule": "",
            "skillspref": "Affiliated with Rachel Carson College1. Have taken CRSN 15, are declared in a STEM major and maintaining academic standing in STEM courses.2. Record of high academic achievements in area or areas in which mentoring is offered. 2. Ability to relate materials in a sensitive and effective manner and general understanding of mentoring dynamics. 3. Experience working with students from multi-cultural and multi-ethnic backgrounds, students with disabilities, and/or economically disadvantaged students.",
            "skillsreq": "Rachel Carson College invites applications for a new program through which continuing STEM students will provide peer assistance and mentorship to first and second year proposed and declared STEM majors who are enrolled in or have taken  CRSN 15 \"Strategies to Jump Start your STEM Learning.\"  STEM Peer Mentors will work with preceptors and advisors in the college to learn the basic skills of student-student peer mentoring. Mentors will assume college leadership roles in developing advising strategies, identifying STEM student needs in particular courses, and training future Mentors. Mentors will also work closely with CRSN 15 instructors to help students make the transition to University-level work, advising them on strategies for effective time management, studying, note-taking and test taking, participate in classes and group sessions (as required) and hold office hours to provide students with experiential knowledge specific to STEM fields. Strong leadership, communication, and interpersonal skills• Must be comfortable speaking in front of large groups of people• Junior or senior standing preferred• Declared in a STEM major• 3.0 or higher UCSC grade point average• Knowledge of and/or experience with academic resources for STEM students",
            "title": "STEM Peer mentor",
            "unit": "CRSN/Oakes College"
        },
        {
            "employmentdate": "2-20-2019 TO 6-10-2020",
            "filingdate": "2/1/19 orUntil Filled",
            "hours": "8-10",
            "pay": "12.00",
            "schedule": "",
            "skillspref": "Experience working in a lab (can be through teaching courses or research)Thorough knowledge of sustainability issues including: energy & water efficiency, green purchasing, and waste diversion (applying sustainable operations to labs a plus!)Lab Safety Training",
            "skillsreq": "Excellent motivation and organizational skills with ability to prioritize work and complete tasks independently in a fast-paced environmentConfidence in interacting and articulately communicating with UC research faculty, Lab P.I.'s and Safety Representatives, and campus operational staffExcellent command of Google Apps (gmail, G-Cal, Drive, etc.)Ability to work 10 hours/week in Sustainability Office (Kerr Hall)Strong interest in working with UCSC laboratories to promote sustainable researchAbility to communicate in a highly professional manner in-person, email, phone, etc.Excellent collaboration skills and experience working in teamsStrong interest in sustainability issues including: energy efficiency, green purchasing, and waste diversionExcellent attention to detailMust be available during the following academic year (Fall 2019-2020)",
            "title": "Green Labs Associate",
            "unit": "Sustainability Office"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "1/31/19 orUntil Filled",
            "hours": "5-12",
            "pay": "12.00",
            "schedule": "",
            "skillspref": "Demonstrated event planning or project planning experiencePrior involvement with Muslim student groups, and/or Muslim community on or off campusDesktop publishing, flyer/poster design, website design and maintenanceFamiliarity or direct experience with related campus groups and committees",
            "skillsreq": "Experience with, and knowledge of, Southwest Asian North African community and culture, with focus on Muslim student needs and experiencesStrong oral, written, and interpersonal skills sufficient to interact with a diverse staff and studentsStrong organizational skills and leadership experienceBasic typing and computer skills, familiarity with Google Drive Apps, Microsoft Office (Word, Excel, Powerpoint)Ability to work under pressure with multiple ongoing projects, varying deadlines, and numerous interruptionsAbility to work collectively in a teamwork environmentMust be responsible, reliable, resourceful, and have initiativeExperience with, and knowledge of, student organizations, campus support services and co-curricular activities",
            "title": "SWANA Programs Intern",
            "unit": "ERC"
        },
        {
            "employmentdate": "ASAP TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "10-15",
            "pay": "17.00",
            "schedule": "Varies",
            "skillspref": "Knowledge and experience working with SQL, Ceph, or protocol buffers is a plus.Courses preferred: Database systems (CMPS 180, 181, or 278)",
            "skillsreq": "To help meet the programing needs of the SkyhookDB incubator, the Center for Research in Open Source Software (CROSS) is looking for a part-time programming assistant to assist our current incubator lead. The programming assistant will work directly with the project scientist leading this incubator as well as with PhD students working on the development of other CROSS-funded research. Development is centered around two open source products: PostgreSQL database and Ceph distributed storage.  Candidates should be Computer Science or Computer Engineering undergraduate or masters student with coding experience, knowledge of C++ and Linux.Courses required: Operating systems (CMPS 111)",
            "title": "Programming Assistant",
            "unit": "SOE"
        },
        {
            "employmentdate": "ASAP TO 4-1-2019",
            "filingdate": "Until Filled",
            "hours": "10",
            "pay": "13.00",
            "schedule": "flexible",
            "skillspref": "Experience in iOS programming and submitting apps to the app store and the use of TestFlight.",
            "skillsreq": "iOS programming and submitting apps to the app store and the use of TestFlight.",
            "title": "iOS Programmer",
            "unit": "Social Sciences - Psychology"
        },
        {
            "employmentdate": "1-8-2019 TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "10-19",
            "pay": "14.00",
            "schedule": "T, TH and/or F",
            "skillspref": "The position prefers experience providing environmental education to people of all ages, experience working with volunteers, as well as creativity and experience in environmental community outreach.  A background in environmental ecology and inquiry-based learning is desired. Work will include facilitating wetland field trips, classroom activities and weekend restoration and outreach events. Ability to speak and write in Spanish is preferred.",
            "skillsreq": "The Watsonville Wetlands Watch seeks a wetland advocate to join our education team. The Wetland Education & Outreach Assistant is a dynamic position that will assist in implementing outdoor wetland-based activities and environmental education initiatives for the youth of the Pajaro Valley. Some education experience is required but does not need to be necessarily environmental ed. This position requires the individual to carry their own transportation and auto insurance.",
            "title": "Wetland Educator",
            "unit": "Watsonville Wetlands Watch"
        },
        {
            "employmentdate": "TO 2019-06-01 00:0",
            "filingdate": "Until Filled",
            "hours": "12",
            "pay": "15.00",
            "schedule": "",
            "skillspref": "Experience with the table saw. Basic knowledge of CNC and laser cutting techniques. Experience with Adobe Illustrator, Photoshop, and or equivalent software.",
            "skillsreq": "Basic knowledge of shop power and hand tools. Including drill presses, jig saws, miter saw, disc/belt sander and panel saw. Basic interpersonal skills and good communication with staff,faculty and other students. willing and able to lift heavy objects up to 100 lbs. assisted or unassisted.",
            "title": "WoodShop Assistant",
            "unit": "Arts - Division"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "20",
            "pay": "11.00",
            "schedule": "Mon-Fri 7am-4pm",
            "skillspref": "Basic computer troubleshooting skills; Math/accounting aptitude; proven ability to make independent judgment calls; demonstrated ability to work ,with people of varied races, ages and socioeconomic backgrounds.",
            "skillsreq": "Clerical/receptionist experience. Experience with filing, writing and answering  phones; detail oriented; strong ability to prioritize; good organizational skills; Intermediate skills in Microsoft Word, Publisher and Excel; ability to lift 50 pounds with or without assistance.",
            "title": "Custodial Office Assistant",
            "unit": "Facilities"
        },
        {
            "employmentdate": "ASAP TO 6-14-2019",
            "filingdate": "Until Filled",
            "hours": "12-19",
            "pay": "11.50",
            "schedule": "By Arrangement",
            "skillspref": "",
            "skillsreq": "Prior experience in building maintenance, grounds maintenance, painting, construction work or as a work crew member required. Familiarity with university or residential facilities maintenance.Demonstrated ability to have a high mechanical aptitude.Demonstrated knowledge of safety practices in the use of hand- and power tools.Ability to follow written and oral instructions and exercise good judgment.  Ability to work under moderate to minimal supervision in a cooperative, team-focused workplace with a diverse student and staff population. Ability to help direct and support the work of new student employees, and to encourage safe work practices among peers. The ability to work cooperatively and respectfully with a diverse student and staff population.The ability to lift and carry items of up to 50 lbs., with or without accommodation; to work from stepladders; to perform work overhead; and to perform tasks requiring repetitive motion.Demonstrated ability to quickly learn and apply new mechanical skills.Excellent communication skills. Willingness to positively represent the Zone facilities staff. Exhibit a high level of responsibility and attention to detail.Ability to drive in the state of California and possession of a  good driving record.Demonstrated ability to be self motivated.",
            "title": "Maintenance Specialist - East Zone",
            "unit": "Facilities"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "10-19",
            "pay": "14.00",
            "schedule": "Mon-Fri, 3:00-6:00pm",
            "skillspref": "Transportation is necessary. Work site is located in the city of Watsonville.Must be reliable and committed to assist at risk students.",
            "skillsreq": "Must be Bilingual, Spanish/English. Math, reading and language arts concepts,in grade levels 10-12.Ability to work with high risk youth in a variety of settings, classroom, group or 1 to 1. Ability to communicate and interrelate with on-site teacher and staff.Willing to travel to Watsonville.",
            "title": "Academic Tutor Mentor",
            "unit": "S. C. County Office of Education/Homeless Program"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "5/15/19 orUntil Filled",
            "hours": "8.5",
            "pay": "15.99",
            "schedule": "Tues/Thurs 8am-12:15pm",
            "skillspref": "Math and/or science proficiency a plus.Familiarity with AVID a plus but not necessary.",
            "skillsreq": "Strong oral and written communication skills: correct English usage, grammar, spelling, punctuation and vocabulary. Strong knowledge in one or more of the following areas: Math (Algebra 1&2, Geometry, Trigonometry, willingness to work with new Common Core Math Standards), Science (biology, elementary physics and chemistry, earth science), high school Spanish or French, English, World/US History. Work confidentially and with discretion. Ability to work with 9th-11th grade students. Work independently to accomplish goals set by district staff. Digital / Computer literate.",
            "title": "AVID Tutor/University Intern",
            "unit": "SHR OCWS"
        },
        {
            "employmentdate": "2018-09-21 00:0 TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "1-10",
            "pay": "11.00",
            "schedule": "Monday-Sunday",
            "skillspref": "- Should be enthusiastic about fitness promotion and administration.- Should be outgoing and able to communicate program information in a positive and friendly manner.",
            "skillsreq": "- Must be dependable, punctual, friendly, courteous, and able to follow instructions.- Must have a good rapport with students, employees, and the public.- Must be able to be assertive when circumstances necessitate.- Must be able to lift 35lbs.",
            "title": "Fitness Program Assistant",
            "unit": "OPERS/Wellness Center"
        },
        {
            "employmentdate": "TO 2019-06-30 00:0",
            "filingdate": "Until Filled",
            "hours": "5-10",
            "pay": "13.00",
            "schedule": "",
            "skillspref": "At least three quarters prior experience a Cantú Queer Resource Center internMaintain a cumulative GPA of 3.0 or higher.Prior experience with Queer studies, Trans studies, or diversity related courses.",
            "skillsreq": "Must have prior experience as a Lionel Cantú Queer Resource Center intern for at least 2 quarters Must maintain a 2.5 average GPAOutstanding leadership and organizational skills. Strong knowledge of and experience with Cantú Queer Center operations, policies, and procedures.Strong knowledge of and experience with all Resource Centers (Asian American/Pacific Islander RC, African American Resource and Cultural Center, American Indian RC, El Centro: Chicanx Latinx RC and the Women's RC.)Knowledge of issues affecting Queer and Trans students in higher education, and the broader community.Ability to mentor and assist in supervising Interns and volunteers.Must have strong oral, written, and interpersonal skills sufficient to interact with a diverse staff and students. Basic typing and computer skills. Ability to work under pressure with multiple ongoing projects, varying deadlines, and numerous interruptions. Must have the ability to work collectively in a teamwork environment. Must be responsible, reliable, resourceful, and have initiative. Experience with, and knowledge of, LGBTQIA+ student organizations at UCSC; experience with, and knowledge of, campus support services and co-curricular activities, especially for Queer & Trans students.",
            "title": "Cantú Lead Intern",
            "unit": "GLBT"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "15",
            "pay": "12.00",
            "schedule": "",
            "skillspref": "-Interest in international education, economic development, or Latin America-Experience in fundraising, marketing or sales-Experience working with databases such as Etapestry/Blackbaud-Experience with financial and administrative support-Spanish language skills a plus-Vehicle highly preferred for artisan sale, post office and bank trips",
            "skillsreq": "-Strong verbal communication skills-Extremely detail-oriented and organized-Responsible, reliable, and proactive",
            "title": "Development and Communications Associate",
            "unit": "Limitless Horizons lxil"
        },
        {
            "employmentdate": "2018-11-05 00:0 TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "20",
            "pay": "12.00",
            "schedule": "Tue/Thurs/Fri/Sat",
            "skillspref": "Experience sorting and delivering mail/packages using a van. Warehouse experience.Sales experience (online postings).",
            "skillsreq": "Possession of a valid license to drive in California and a good driving record.Ability to safely move furniture and equipment weighing up to 75 lbs. (and paper cases weighing 50 lbs.).Ability to perform independently and with a high degree of initiative, integrity, and good judgment.Ability to follow directions with special attention to safety issues.Experience working with, around, for diverse groups of people effectively, cooperatively, and respectfully.Clear oral and written communication skills.Ability to identify and sort/organize items based on type and enter items into inventory.",
            "title": "Material Handler/Warehouse Assistant",
            "unit": "Risk Services"
        },
        {
            "employmentdate": "2019-01-06 00:0 TO 2019-03-22 00:0",
            "filingdate": "Until Filled",
            "hours": "10",
            "pay": "16.26",
            "schedule": "M-F",
            "skillspref": "",
            "skillsreq": "Skills, Knowledge, and Abilities: 1. Proven record of high academic achievements in area or areas in which tutorial assistance is offered. 2. Ability to relate materials in a sensitive and effective manner and general understanding of tutoring dynamics. 3. Experience working with students from multi-cultural and multi-ethnic backgrounds, students with disabilities, and/or economically disadvantaged students. 4. Good academic standing, ability to listen, have commitment, and at least JUNIOR status or proven mastery of subject area.",
            "title": "MSI Learning Assistant/Tutor",
            "unit": "Learning Support Services"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "10 - 19",
            "pay": "11.00",
            "schedule": "varies",
            "skillspref": "Experience working with volunteers or previous volunteer experience is beneficial but not required.",
            "skillsreq": "*Experience with computer programs including Filemaker Pro, Word, excel and email. *Strong attention to detail. *Excellent interpersonal skills, and able to work well as a team with volunteers and staff members.*Must work well with the public and have excellent customer service skills. *Must be well organized and able to occasionally work independently. *Must be comfortable multi-tasking. *Must have a current, valid driver’s license and be willing to wear Seymour Marine Discovery Center uniform when working with the public.",
            "title": "SMDC Administrative Assistant",
            "unit": "PB Sci-IMS/LML"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "Until Filled",
            "hours": "4",
            "pay": "12.00",
            "schedule": "variable",
            "skillspref": "Demonstrated knowledge of Windows and Macintosh computer systems.  Knowledge of web streaming technologies.  Experience with audio or video editing software.  Experience with AV equipment and video recording.  Experience with computer graphics sufficient to produce operating instructions and diagrams.",
            "skillsreq": "Strong customer service skills required. Knowledge of audio-visual equipment (digital audio recorders, digital video and still cameras, video/data projectors; sound systems) sufficient to operate unsupervised.  Good mechanical aptitude sufficient to operate and troubleshoot a wide variety of audio-visual and computing equipment. Ability to learn basic operation and installation methods of audio-visual and computing equipment in facility.  Communication skills sufficient to explain technical concepts to non-technical people and interact effectively and courteously with faculty, staff, students and off-campus clients. Ability to use web content management systems, social media, and film editing software. Clerical skills including typing, data entry, filing, telephone, and organizational skills.  Ability to follow verbal and written instructions.  Ability to troubleshoot basic technical problems and develop appropriate solutions.  Ability to transport equipment safely, by exercising appropriate judgment.",
            "title": "Emeriti Association AV Assistant",
            "unit": "University Relations"
        },
        {
            "employmentdate": "2018-09-24 00:0 TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "3-19",
            "pay": "11.00",
            "schedule": "various",
            "skillspref": "Experience working with children and some knowledge of child development preferred.",
            "skillsreq": "Must be at least 18 years of age.  Reliability is essential.   Criminal clearance is required for all positions before work can start. Health Screening to include a TB test (form provided) and proof of immunizations and/ or immunity to Measles, Pertussis and Influenza required: see new CA legislation here: https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201520160SB792    Must have at least 3.5 hour block shifts available on MWF or TTH Shifts are scheduled between 7:15 and 6:30 weekdays",
            "title": "Child Care Teaching Aide",
            "unit": "Early Education Services"
        },
        {
            "employmentdate": "ASAP TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "5-10",
            "pay": "11.00",
            "schedule": "Flexible",
            "skillspref": "Website maintenance skills and the ability to learn new programs. Experience working with volunteers from diverse backgrounds. Ability to develop event marketing, flyers, assist with event planning, setup, and execution preferred.",
            "skillsreq": "The Student Office Assistant must be friendly, courteous and patient. Excellent interpersonal, communication, organizational and computer skills are required. Desire and ability to work with non-student, retired faculty/staff, and the general public, maintaining a customer-orientated approach at all times.Experience:• Knowledge of office procedures and standard office equipment• Using Macintosh or personal computers, and word processing skills• Work with unit staff on multiple detail-oriented projects with overlapping deadlines and demandsAbilities and Skills:• Excellent communication, and public relations skills• Work well both independently and as part of a team, seeking assistance as needed• Ability to research information and provide appropriate referrals• Strong computer skills and demonstrated ability to use Excel, Word, and email with accuracy• Strong written and verbal communication skills; ability to relay information with accuracy• Analytical skills sufficient to resolve reporting discrepancies• Speak and write with clarity and grammatical correctness to give concise and accurate information• A willingness to learn new information and tasks quickly, and the ability to prioritize tasks• Ability to maintain social media accounts• Take initiative to determine what needs to be done while following established duties and protocols• Exercise discretion in handling confidential information and materials• Demonstrate reliability and responsibility• Flexibility and willingness to undertake special projects or have work assignments/priorities change• Effectively and tactfully interact with diverse groups of people• Ability to follow appropriate procedures for handling cash, checks, and credit cards with accuracy• Ability to interpret policies and procedures from both verbal and written sources• Writing and proofreading skills to edit and maintain clear, concise, and accurate documents• A willingness to learn new programs",
            "title": "Retirees and Emeriti Center Office Assistant",
            "unit": "University Relations"
        },
        {
            "employmentdate": "2018-09-25 00:0 TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "10-15",
            "pay": "11.00",
            "schedule": "",
            "skillspref": "1. Good academic standing (at the time of application and during the academic year)?2. An interest in counseling, advising, and helping fellow students?3. Good interpersonal and communication skills?4. Strong leadership skills5. Strong attention to detail and organizational skills?6. Experience working with a diverse student body?7. Experience understanding the educational processes at UC Santa Cruz?8. Evidence of ability to work effectively as a team member9. Familiarity with the use of MyUCSC portal and basic computer skills?10. Familiarity with university polices and guidelines for students at UC Santa Cruz?11. A commitment of one (1) academic year to a peer advising position12. Knowledge and understanding of confidentiality when dealing with sensitive matters and student records?13. Ability to work 2 - 4 hour blocks of time between 9a-12p and 1p-4p (occasional evening hours)",
            "skillsreq": "Sophomore, junior, or senior standing by start Fall 2018.",
            "title": "Porter College Peer Adviser",
            "unit": "Porter & Kresge College"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "19 maximum",
            "pay": "11.00",
            "schedule": "",
            "skillspref": "",
            "skillsreq": "Possess an understanding of how to work with youth while being sensitive to their needs. Be patient, flexible and willing to assist wherever you may be needed (Learning Center, Games Room, Gym, Cafe, Garden). Moreover, possess a practical knowledge and experience to implement a variety of programs, including rules and regulations of indoor games, care and use of equipment and how to conduct tournaments, contests, and skills clinics",
            "title": "Youth Development Specialist",
            "unit": "Boys & Girls Club of Santa Cruz"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "15 - 19",
            "pay": "11.00",
            "schedule": "TBD (more hrs on breaks)",
            "skillspref": "Event coordinating experience and retail and/or restaurant experience is helpful, but not required. Experience using Google Drive, Microsoft Office Suite, database systems (preferably Mac and FileMaker Pro), and strong writing skills a plus.",
            "skillsreq": "Must be detail-oriented, dependable, and able to work independently. Must have excellent customer service and interpersonal skills with ability to provide clear and concise information to the public and co-workers. Must be flexible and able to work in a sometimes fast-paced, changing environment. Good organizational and time management skills; ability to multi-task and to work accurately with frequent interruptions to meet deadlines. Must have the ability to establish and maintain cooperative working relationships with volunteers, staff, and interns. Must be able to interact with the public in a positive, professional manner. Ability to learn to manage special events; willingness to learn and share information about the Seymour Center with the public. Must be able to work weekdays, weekends, evenings, and during school breaks including finals week, spring, summer (up to 30-40 hours), and winter breaks. Must have data entry, word processing, and email experience. Neat and clean appearance, including willingness to wear staff uniform (Seymour Center navy blue polo shirt with khaki pants) while working. Possess a valid California driver's license.",
            "title": "Sr. Office Asst/Facility Rental Coordinator",
            "unit": "PB Sci-IMS/LML"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "3-10",
            "pay": "13.00",
            "schedule": "Flexible",
            "skillspref": "",
            "skillsreq": "Must have access to DSL Camera.Still photo and video skills-capturing, editing, processing.Experience with Abobe InDesign, Photoshop and CANVA.Ability to convert graphics and other documents to web friendly formats.Keen sense of design and attention to detail. Experience with social sharing sites Instagram, Twitter, Pinterest, and Facebook.",
            "title": "Photographer & Social Media Specialist",
            "unit": "Life Lab Science Program"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "19 maximum",
            "pay": "11.00",
            "schedule": "",
            "skillspref": "",
            "skillsreq": "Possess an understanding of how to work with youth while being sensitive to their needs. Be patient, flexible and willing to assist wherever you may be needed (Learning Center, Games Room, Gym, Cafe, Garden). Moreover, possess a practical knowledge and experience to implement a variety of programs, including rules and regulations of indoor games, care and use of equipment and how to conduct tournaments, contests, and skills clinics.",
            "title": "Program Specialist at the Boys and Girls Club",
            "unit": "Boys & Girls Club of Santa Cruz"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "1/16/19 orUntil Filled",
            "hours": "15-20",
            "pay": "12.00",
            "schedule": "M-W-F TBD",
            "skillspref": "Experience with courses related to agroecology.",
            "skillsreq": "Must have completed Chadwick Garden internshipCompetence in raised bed gardening, including cultivation, transplanting & seeding, cover crops and harvest.As this job involves physical labor, candidates must be able to lift 40 lbs. and perform physical work.Support Manager and Assistant Manager in facilitating student engagement in all garden related activities.May be asked to cover weekend watering on an as needed basis.",
            "title": "Garden Assistant",
            "unit": "Social Sciences - Agroecology"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "12/31/18 orUntil Filled",
            "hours": "20",
            "pay": "11.00",
            "schedule": "Monday -  Friday",
            "skillspref": "*Good interpersonal skills sufficient to interact effectively with co-workers, campus community, staff, and other students. *Prioritize assignments, customer service needs and interruptions while working independently.*Perform manual labor and safely lift supplies while bending and/or stooping.",
            "skillsreq": "*Ability to exercise diplomacy in dealing with diverse groups of people.*Read, write, and follow oral and written instructions and demonstrate mechanical aptitude.*Possess valid CA Driver's License*Safely drive a University vehicle*Work independently with moderate supervision.*Identify hazardous problems and use good judgment as to when to report problems/safety hazards.*Ability to navigate and work with Windows-based & Mac software.*Must be able to be in the outdoors in various weather conditions.*Must be able to lift 50 lbs.",
            "title": "Student Auto Attendant",
            "unit": "Fleet Services"
        },
        {
            "employmentdate": "1-7-2019 TO 9-30-2019",
            "filingdate": "1/1/19 orUntil Filled",
            "hours": "10-15",
            "pay": "11.50",
            "schedule": "flexible",
            "skillspref": "(1) familiarity with campus resources, events, opportunities, fees, policies, and so on.(2) Social media activity.(3) Presentation skills - to be a good public speaker and enjoy it.  (coaching available)(4) fluent in Spanish, Mandarin, Cantonese, or other language needed to support students and their families(5) preferred but not required - you have taken or plan to take Summer Session classes.",
            "skillsreq": "(1) Excellent interpersonal skills - polite, tactful, warm, patient.  Communication (written and verbal) is thorough and accurate. Enjoy customer service.(2) Strong computer skills - research, excel, calendaring, editing/review of written work, documents, newsletters. (Some training available but should be familiar with these programs.)(3) Highly organized, terrific time management, with the ability to organize our office and build new processes to increase efficiency and save resources.(4) Independent worker with team-work orientation - very small office (4 staff, 4 students, small space) so collaborative work style and adaptability a must.*note additional 2 requirements:Please submit a cover letter introducing yourself and what strengths you would bring to the Summer Session Office, how you would contribute to our team. Describe a time when you positively contributed to a team that shows you learn new skills quickly. Write about yourself with your personality!  Submissions without a cover letter will not be reviewed.Student Assistants are needed ALL summer (20-40 hours per week, flexible for classes, etc.).  Only applicants who can work in summer will be considered for the winter/spring/fall job.",
            "title": "Summer Session Student Assistant",
            "unit": "VPDUE-Summer Session"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "up to 19",
            "pay": "14.00",
            "schedule": "arranged",
            "skillspref": "Previous math tutoring experience preferred but",
            "skillsreq": "Working knowledge of mathematics and statistics. Tutors must be patient, friendly, good listeners, detail oriented, organized and help with arithmetic, intro algebra, college algebra, trigonometry, business calculus, finite math, statistics, single and multivariable calculus, differential equations and linear algebra. Focus is on using student's knowledge and resources to help solve problems and find errors in solutions they've done. Tutoring is drop-in and not by appointment. Master tutors are available to help if necessary.",
            "title": "Cabrillo College MLC: Math and Statistics Tutor",
            "unit": "Cabrillo Math Learning Center"
        },
        {
            "employmentdate": "TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "20",
            "pay": "11.00",
            "schedule": "M-F 9-4",
            "skillspref": "The ability to work unsupervised and prioritize tasks in accordance with the needs of the Library Operations Unit.  Experience dealing professionally with a wide range of people, both staff and public.",
            "skillsreq": "Valid California Drivers License and the ability to lift 40 lbs.",
            "title": "Operations Assistant",
            "unit": "McHenry Library - Operations"
        },
        {
            "employmentdate": "2018-09-23 00:0 TO 2019-06-15 00:0",
            "filingdate": "Until Filled",
            "hours": "6-8",
            "pay": "11.50",
            "schedule": "Monday-Friday",
            "skillspref": "Experience with Macintosh word processing programs. Experienced and knowledgeable in waste reduction and management. Experience with desktop publishing and web design. Ability to recognize a gap in the waste reduction program, and determine a low impact solution.",
            "skillsreq": "Has taken college level courses relating to environmental and social issues.  Must be self motivated , have a positive work attitude, and be able to work in a composting team atmosphere. Ability to work with word processing programs. Ability to conduct research in preparation for developing an organized presentation. Translate/demonstrate daily program goals to diverse populations using strong public speaking skills. Ability to be a role model. Ability to work safely with general cleaning chemicals. Must be able to work a steady number of hours per week throughout each quarter. Ability to bend and lift and perform other repetitive motions.Possession of a valid California driver’s license and a good driving record.",
            "title": "Waste Reduction Program Specialist - West Zone",
            "unit": "Facilities"
        },
        {
            "employmentdate": "2018-09-23 00:0 TO 2019-06-13 00:0",
            "filingdate": "Until Filled",
            "hours": "10+",
            "pay": "12.50",
            "schedule": "Mon - Fri 7:00 am-3:30pm",
            "skillspref": "Must have a valid Driver's License",
            "skillsreq": "Ability to comprehend Grounds policies and procedures. Ability to work independently with minimal supervision. Ability to make decisions and prioritize the management of projects. Ability to work effectively in dealing with diverse groups of people. Clear oral and written communication skills. Basic knowledge of Windows, Word, Excel and File Maker Pro.Ability to  fill out weekly Excel timesheets & bi-monthly Cruz Pay electronic timesheets punctually and accurately. . Ability to safely use small powered equipment and wear required safety gear. Ability to safely move containers and equipment weighing up to 50 pounds with or without accommodation. Ability to work outdoors in all weather conditions and in dusty/pollen conditions. Possession of a valid drivers license. Available to work in at least 3 hour blocks anytime between 7:00am and 3:30 pm M-F",
            "title": "Grounds Student Assistant",
            "unit": "Physical Plant"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "up to 19",
            "pay": "11.00",
            "schedule": "arranged",
            "skillspref": "Previous math tutoring experience preferred but",
            "skillsreq": "Working knowledge of mathematics and statistics. Tutors must be patient, friendly, good listeners, detail oriented, organized and help with arithmetic, intro algebra, college algebra, trigonometry, business calculus, finite math, statistics, single and multivariable calculus, differential equations and linear algebra. Focus is on using student's knowledge and resources to help solve problems and find errors in solutions they've done. Tutoring is drop-in and not by appointment. Master tutors are available to help if necessary.",
            "title": "Cabrillo College MLC: Math and Statistics Tutor",
            "unit": "Cabrillo Math Learning Center"
        },
        {
            "employmentdate": "ASAP TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "10-15",
            "pay": "11.00",
            "schedule": "",
            "skillspref": "Tutoring experience is a HUGE plus, child care experience of varying degrees a plus as well, athletic experience, ability to lift 50 pounds, technical computer knowledge is good.",
            "skillsreq": "Working closely with kids and tutoring in small groups of varied ages during our daily power hour homework time, leading arts and crafts projects, coordinating outside games (basketball, football, dodgeball and other team games), and monitoring computer use. You will also be asked to help make snacks, do dishes, clean bathrooms and other areas of the clubhouse.",
            "title": "Youth Development Specialist",
            "unit": "SHR OCWS"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "10",
            "pay": "18.00",
            "schedule": "",
            "skillspref": "",
            "skillsreq": "Competent & confident working with high school students in all academic content areas, English (writing), Science (biology, Chemistry, physics), Social Science, Computer skills and Math (algebra,geometry,alg2/trigonometry, calculus, statistics). Need to be able to keep a group of 7-8 students focused and on task. Must be able to provide own transportation to/from work site.",
            "title": "AVID Tutor",
            "unit": "SHR OCWS"
        },
        {
            "employmentdate": "ASAP TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "5",
            "pay": "16.00",
            "schedule": "",
            "skillspref": "Strong English and Spanish literacy preferred. Understanding of language development and how to support English Language learners in all core subjects.",
            "skillsreq": "Experience working with young adults. Proficiency in English language arts,mathematics, social studies and science at the high school level. Strong interpersonal skills and willingness to work with staff to support students.Must be able to provide own transportation to/from work site.",
            "title": "Homework Club tutor",
            "unit": "Soquel High School"
        },
        {
            "employmentdate": "TO 2019-06-12 00:0",
            "filingdate": "Until Filled",
            "hours": "6-12",
            "pay": "12.00",
            "schedule": "varies",
            "skillspref": "Please apply only if you have a strong desire to work with plants. We will hire only those who have nurtured plants. Please let us know ANY experience you have growing plants.",
            "skillsreq": "Ability to stand for long periods of time; ability to maneuver and transport 100lbs with the use of a cart. Must be reliable and conscientious. Ability to interact effectively with other student workers, staff and faculty. Effective tetanus shot booster required - UC Health Center can provide.Knowledge of and/or experience in botany and/or horticulture.Ability to perform skilled and sophisticated work, using independent judgement, with minimal supervision.- Ability to maneuver and transport 100lbs with the use of a cart.",
            "title": "PB SCI Greenhouse Assistant IV",
            "unit": "PB Sci-Greenhouse"
        },
        {
            "employmentdate": "2018-09-26 00:0 TO 2019-06-13 00:0",
            "filingdate": "5/30/19 orUntil Filled",
            "hours": "4",
            "pay": "15.99",
            "schedule": "Wednesday/Friday 10-12",
            "skillspref": "",
            "skillsreq": "Oral and written communication skills: correct English usage, grammar, spelling, punctuation and vocabulary.  Knowledge of mathematics in Pre-Algebra through Geometry.  Work confidentially and with discretion.Ability and interest to work with 8th grade students and work independently to accomplish goals set by teacher(s). Computer literate.",
            "title": "AVID Tutor/University Intern",
            "unit": "SHR OCWS"
        },
        {
            "employmentdate": "ASAP",
            "filingdate": "Until Filled",
            "hours": "3",
            "pay": "14.75",
            "schedule": "Tuesdays and Thursdays",
            "skillspref": "Knowledge of AVID and bilingual",
            "skillsreq": "Ability to work with 8th grade students in any subject area while they are in their AVID elective class.",
            "title": "AVID Tutor",
            "unit": "Shoreline Middle School"
        },
        {
            "employmentdate": "ASAP TO Jun-13-2019",
            "filingdate": "Until Filled",
            "hours": "10 - 20",
            "pay": "11.00",
            "schedule": "TBD",
            "skillspref": "Prefer experience with Mac OS page layout skills, including a familiarity with Adobe InDesign, Illustrator and Photoshop. At least basic carpentry skills are desired. Prefer familiarity or at least a basic comfort level in safely handling power tools such as portable drills, multi-tools, handheld powered saws and table saws, as well as hammers, screwdrivers, wrenches and other hand tools.  Skills to edit video and add subtitles to video on Mac OS computers for use on digital frames and digital players attached to large screen televisions desired. The ability to edit and add subtitles to video, experience in gaming development to create Mac OS or iOS interactives, including AR or VR creation for interactive exhibit components are also desirable skills.The ability or willingness to learn to analyze a malfunctioning piece of AV or other exhibit related equipment to determine the cause and a simple solution is desired.Basic knowledge of construction and art sheet materials, adhesives and hardware preferred. Prefer proven artistic and mechanical skills, with a keen aesthetic sense and other relevant capabilities for potential involvement in the design and fabrication of exhibits as opportunities arise. A current, valid driver's license is preferred.",
            "skillsreq": "Basic mechanical aptitude and aesthetic sense. Some experience in using basic hand and power tools to do light construction or at least make repairs to exhibit elements. Must be detailed oriented, but most importantly must be comfortable multi-tasking, and when necessary, making decisions requiring creative \"outside-of-the-box\" problem-solving skills. Ability to realize when to ask for guidance. Some moderate lifting with and without assistance.The ability to work independently as well as able to work as a team with volunteers and staff. Be reliable to arrive when scheduled and to work safely with tools and equipment around the public, volunteers and other staff. Able to select proper cleaning products and techniques to clean exhibit component surfaces without damaging them. A large part of the job is cleaning and providing assistance to Exhibits Curator/Designer through miscellaneous tasks as assigned. Willingness to get dirty, and to occasionally work non-standard evening or weekend hours during installations or major projects is helpful.Ability to safely use step and platform ladders to clean and maintain elevated exhibit components is expected.Must be neat and clean in appearance and willing to wear a Seymour Marine Discovery Center uniform of logo navy polo shirt with khaki pants.",
            "title": "Exhibits Assistant",
            "unit": "PB Sci-IMS/LML"
        },
        {
            "employmentdate": "Sep-22-2018 TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "10",
            "pay": "11.00",
            "schedule": "Variable, M - F",
            "skillspref": "Experience using Word, Excel and the Internet for research purposesStrong communications, writing and office skillsWilling to learn new skills and computer programs",
            "skillsreq": "Dependable and has a positive attitudeStrong organizational skills with the ability to sort and track papers and projects systematically and efficientlyAbility to balance multiple tasks and projectsAbility to work independently with minimum supervision or as a coordinated team, with sensitivity to othersAbility to follow written and oral directionsAbility to type accurately and quickly with good attention to detail for extended periods of time on a computerAbility to deal responsibly and with discretion to maintain the security of confidential information and materialsExperience using Windows and /or Macintosh operating systemsWillingness to show initiative and adhere to a regular scheduleMust be able to work off-campus, University Relations Advancement Services is located a 100 Enterprise Way Ste E100, Scotts Valley, CA",
            "title": "Biographic Data Entry Assistant IV",
            "unit": "University Relations-University Events"
        },
        {
            "employmentdate": "Sep-22-2018 TO 6-13-2019",
            "filingdate": "Until Filled",
            "hours": "10-20",
            "pay": "11.00",
            "schedule": "Variable, Weekends",
            "skillspref": "Marine science background is helpful. Interest in pursuing marine science, environmental education, environmental interpretation, or environmental studies as an educational or career goal preferred. Excellent people skills required. Bilingual skills are a plus. Experience working with volunteers or previous volunteer experience is beneficial but not required. Experience in public speaking, interpretation training, outdoor education, and/or leading tours for groups of people. Customer service experience in a changing and fast-paced environment is helpful but not required.",
            "skillsreq": "Excellent interpersonal skills, and ability to work well as a team member with volunteers and staff. Ability to follow instructions provided by the supervisor. Must work well with the public and have excellent customer service skills. Must be well-organized and able to work independently. Must be comfortable multi-tasking. Must have a current, valid driver's license. Must be reliable, punctual, and detail-oriented with excellent time management skills. Experience with computer programs including Google Drive, Word, Excel and email. Neat and clean appearance, including wearing staff uniform (Seymour Center navy blue polo shirt with khaki pants) while working. Must be willing to work, on weekends, during school breaks including finals, spring, summer, and winter breaks.",
            "title": "Visitor Programs Student Assistant",
            "unit": "PB Sci-IMS/LML"
        },
        {
            "employmentdate": "8-1-2018 TO 6-30-2019",
            "filingdate": "Until Filled",
            "hours": "no more than 20",
            "pay": "14.00",
            "schedule": "varied",
            "skillspref": "• Maintain a good academic standing.• Ability to communicate orally and in writing in English and Spanish.• Possession of valid California Driver’s License.• Familiarity working with parents/ families.• Experience presenting and facilitating workshops.• Knowledge about A-G college requirements, financial aid programs, and the college application process.",
            "skillsreq": "MUST BE FLUENT IN ENGLISH AND SPANISH.  POSITION IS OFF CAMPUS IN WATSONVILLE• Desire to work with educational disadvantaged and low-income middle school parents and students.• Sensitivity to diverse racial, ethnic, and/or low socioeconomic groups.• Dependable and professional work attitude.• Strong leadership, communication, and interpersonal skills.• Strong organizational and time management skills.• Demonstrate excellent judgment and discretion in handling confidential and sensitive information.• Demonstrate strong attention to detail.• Ability to work independently with minimal supervision and establish and maintain effective work relationships.• Ability to accurately follow oral and written instructions.• Ability to ask clarifying questions.• Ability to work between 12-19 hours a week with some special exceptions.• Ability to work a flexible schedule, including evening and weekend events.• Ability to travel to and from schools, homes, and program office. • Basic knowledge and understanding of computer technology (Macintosh or Window system).• Desire to learn additional software, as required by the department.• Undergraduate status applicants only.**MUST BE BILINGUAL IN ENGLISH AND SPANISH*****MUST HAVE CAR TO TRAVEL TO SCHOOL SITE IN WATSONVILLE**",
            "title": "EPC Family Involvement Intern",
            "unit": "EPC"
        },
        {
            "employmentdate": "ASAP TO 6-30-2019",
            "filingdate": "Until Filled",
            "hours": "15-19",
            "pay": "14.00",
            "schedule": "Variable w/in M-F 8a-5p",
            "skillspref": "• Have one semester of college experience.• Stem Major or background.• Knowledge or academic and college preparation programs such as GEAR UP, EAOP, MESA, AVID or Upward Bound.• Prior Tutoring experience in math, English language arts, science and history at secondary schools.",
            "skillsreq": "•Must be an undergraduate student at an institution of higher education.•Documentation of exemplary completion of math courses through Algebra II and above. •The ability to communicate effectively and respectfully with people from different racial, ethnic, and cultural backgrounds and lifestyles, demonstrating sensitivity to their needs.•Experience and discretion in handling confidential and sensitive information.•Work independently with minimal supervision and establish and maintain effective work relationships within the EPC and school site; work independently or within a team.•Ability to work a minimum of 15 hours per week, M-F and some evenings and weekends.•Prepare and present written and oral information clearly and effectively.•Working knowledge of computer operating systems (Microsoft Word, Excel, File Maker Pro), peripherals, software, e-mail and internet access. •Ability to sit at a desk and use a computer for long periods of time.•Maintain good academic standing at enrolled institution of higher education; must enroll in 12 units per quarter/semester.•* If applying to the San Jose Cal-SOAP Academic Coach position, candidate must be able to demonstrate financial need (quality for student loans, workstudy, etc.).•Must have a minimum overall GPA of 2.5•Must have California driver’s license.•Must poses reliable mode of transportation to school-site and/or program office.",
            "title": "EPC Academic Coach/Intern",
            "unit": "EPC"
        },
        {
            "employmentdate": "TO 2019-06-30 00:0",
            "filingdate": "Until Filled",
            "hours": "4-6",
            "pay": "23.00",
            "schedule": "variable",
            "skillspref": "",
            "skillsreq": "1.      Demonstrate a commitment and ability to retain, motivate, and engage historically marginalized students with intention and cultural humility. 2.      Previous experience mentoring or supervising undergraduate students through research projects (e.g., supervising Research Assistants).3.      Experience teaching and/or mentoring community college student, students with disabilities, first-generation students, and/or economically disadvantaged students.4.      Record of high academic achievements and strong program of research in Humanities, Social Sciences, STEM, or Arts. Good academic standing.5.      General understanding of mentoring in research, mentorship dynamics and ability to relate materials in a mindful and effective manner.6.      Demonstrate commitment and patience to learn new methods of engaging with historically marginalized students.",
            "title": "Graduate Research Mentor",
            "unit": "SAEI"
        },
        {
            "employmentdate": "ASAP TO 6-23-2019",
            "filingdate": "Until Filled",
            "hours": "5",
            "pay": "11.00",
            "schedule": "Varies",
            "skillspref": "Ability to work outside and lift and move garden materials.",
            "skillsreq": "Education or experience in one or more of the following areas: gardening, horticulture, plant science, or strong desire to learn how to grow, build and maintain a garden. Strong communication skills; organizational skills and leadership experience; experience working in a team environment; cultural competency skills",
            "title": "Colleges 9 & 10 Garden Club Lead",
            "unit": "College Nine & College Ten"
        }
    ]
]